<template>
<div id="app">
  <!-- <HelloWorld msg="Welcome to Your Vue.js App"/> -->
  <div class="navbar">
    <ul>
      <li><a href="#about" onclick="smoothScroll('#about')">О нас</a></li> <!-- Описание команды | О нас -->
      <li><a href="#works" onclick="smoothScroll('#works')">Наши работы</a></li> <!-- Проекты | Наши работы -->
      <li><a href="#team" onclick="smoothScroll('#team')">Наша команда</a></li> <!-- >Наша команда | Действующие и бывшие участники -->
      <li><a href="#social" onclick="smoothScroll('#social')">Мы в соцсетях</a></li> <!-- Ссылки на соц. сети | Мы в соцсетях -->
    </ul>
  </div>

  <header>
    <table width="100%" cellspacing="0" cellpadding="0">
      <tr>
        <td id="logo"><img src="img/logo.png" width="100" alt="Логотип команды"></td>
        <td valign="middle" id="logo-text-1">Официальный сайт команды ATOM</td>
        <td valign="middle" id="logo-text-2">Стремящиеся к новым вершинам | Aratana Takami O Mezasu</td>
      </tr>
    </table>
  </header>

  <hr class="hr-main" />

  <button name="Go_to_Top_button" onclick="topFunction()" class="go-top" title="Наверх">&uarr;</button>

  <div id="about">
    <h1>О нас</h1>
    <div id="text">
      <p><strong>"Стремящиеся к новым вершинам"</strong> или, попросту, <strong>команда ATOM</strong> - небольшое объединение людей разных возрастов, национальностей и интересов, которых свело вместе одно увлечение, а именно - жажда созидания. Что может быть приятнее, чем развиваться и совершенствовать свои знания? Конечно же создавать что ни будь своё! И не просто создавать, а создавать для кого-то, зная, что твоя работа может принести хоть кому-нибудь пользу. И под пользой мы необязательно имеем ввиду практическую. Нет! Радость, хорошее настроение и способ скоротать немножко свободного времени - это всё можно дать людям, приложив лишь немного усилий. Разве это не прекрасно? Ради этого явно стоит жить.</p>

      <p>Так кто же мы такие? Мы - просто группа людей, которые хотят создавать что то своё. Не важно, нужно ли кому то это, есть ли аналоги тому, что мы создаём. Нам нравится сам процесс, а если кому то приглянется и результат, что же, это будет очень даже хорошо!)</p>

      <p><strong>| ATOM расшифровывается, как "Aratana Takami O Mezasu" или "Aratana Takami O Mezashimasu", что в переводе с японского и значит "Стремящиеся к новым вершинам"</strong></p>

      <p>На данный момент слово "команда" - это скорее отсылка к нашему прошлому. В далёком 2012 году, на одном небольшом, но очень хорошем, форуме, встретились 2 человека. Оба они занимались изучением кодинга на простеньком движке, написанном на c++ и оба были охвачены желанию к созиданию. Звали их Андрей и Эд. Они были лишь детьми, играющимися в программистов, но играть в одиночку скучно, поэтому они решили объединиться и делать что то своё вместе. Так и началась история нашей команды.</p>

      <p><strong>| Первая наша команда называлась ERKD. Эта аббревиатура не имела логической расшифровки. Она получилась из слияния фраз "Evolution Retryborn" и "Knight of Death", которые, в свою очередь, были бывшими названиями проектов Эда и Андрея.</strong></p>

      <p>Не буду расписывать историю ERKD во всех красках. Где то в группе, помню, выкладывались вырезки из нашего развития. Да и на сайте можно найти информацию по этой теме. Скажу лишь, что то, что мы делали, не было идеальным. Скорее даже, вызывало отвращение у тех, кто это видел. Но мы не сдавались! Мы продолжали стараться и идти к нашей цели - сделать что то достойное, своими руками. Постепенно мы становились опытнее, наш проект обретал форму (не обошлось без пары - тройки перерождений проекта), а у нас появлялись первые фанаты, друзья и союзники. Со временем к нам начали присоединяться ещё люди. Вместе мы постепенно делали наш проект, общались, получали удовольствие от процесса, развивались и набирались опыта. Через какое то время, многие из участников основного проекта заявили об открытии своих собственных. Это привлекло ещё фанатов, многие из которых были готовы помогать нам, а в итоге стали нашими хорошими друзьями. Но время шло, мы росли, как и наше самомнение. В 2014 году в нашей команде произошёл разлад из за которого мы разделились на 2 части, бывшую ERKD, которая забрала с собой основной проект и новую, нынешнюю, ATOM, которую создала основная масса бывших ERKDшников. Новая команда оставила за собой все второстепенные проекты прошлой команды.</p>

      <p><strong>| Все проекты, которыми мы занимались до 2016 года, были посвящены аниме тематике и делались на одном и том же движке.</strong></p>

      <p>После этого момента у нас были некоторые перепалки, между сторонами. Наши отношения складывались не лучшим образом, но в конце концов, когда основной проект застрял в состоянии, близком к завершению, что то пошло не так и мы, померившись и вновь начав общаться, приложили небольшое усилие для завершения нашего общего детища (атом прикладывал скорее моральные усилия, но это тоже считается, я думаю...). Так, я бы даже сказал, успешно закончилась история ERKD. А АТОМ остался, хотя большая наша часть, решила оставить разработку своих проектов. Людей можно понять. Личная жизнь там... учёба, все дела. А те, что остались - а это лишь пара человек, работают со скоростью сонных улиток. Но, надеюсь, когда ни будь это исправится.</p>
    </div>
  </div>


  <div id="works">
    <h1>Наши проекты</h1>
    <div id="text">
      <h3>*В разработке:</h3>

      <p><strong>Naruto: Operation Red Moon</strong> - основной проект команды. Посвящён аниме "Наруто", а именно преступной организации "Акацуки" - главным протагонистам данного аниме.</p>

      <p><strong>Naruto: New Generation</strong> - проект, не столько команды АТОМ, сколько их старых союзников. Делается на абсолютно другом движке, посвящен "Наруто". Обещает множество интереснейших возможностей, которые обойдут даже современные файтинги от крупных компаний, таких, как bandai namco. Графическая часть, к сожалению 2D, но это не делает игру хуже. Хоть проект не наш, продвигать его в массы мы просто обязаны.</p>

      <p><strong>Fairy Tail: Battle of Wizards</strong> - проект, претерпевший самое большое количество перерождений, за свою историю. Посвящён аниме "Хвост Фей". После очередного перерождения проект не будет уступать по возможностям и качеству нашей лучше работе.</p>


      <h3>*Завершенные/замороженные:</h3>

      <p><strong>Naruto: The Legendary Hero</strong> - бывший основной проект команды ERKD, а так же один из лучших вышедших (на период начала 2016 года) проектов подобного типа. Посвящен аниме "Наруто", страдает критической нехваткой персонажей, но отличается от остальных прекрасной графикой и динамикой. Официально завершён и закрыт.</p>

      <p><strong>Bleach: The Soul and Sword</strong> - проект по аниме "Блич". Несколько версий проекта уже увидели свет. Сейчас находится в непонятном завершёно-замороженном состоянии.</p>

      <p><strong>Shonobi Life</strong> - фан карта для warcraft 3. Основная вселенная карты "Наруто", но имеются отсылки к другим вселенным и довольно интересные возможности. Сейчас проект находится в заброшенном состоянии, однако исходный файл всё ещё находится на моём компьютере, если желание вновь заняться им, появится, он будет завершён. Хотя скорее всего, он будет перенесён на движок второй доты. Но не стоит ждать этого в ближайшее время.</p>
    </div>
  </div>


  <div id="team">
    <h1>Команда (WIP)</h1>
    <div id="text">
      <center>
        <p>Ничто не говорит о команде так, как её труды. Тем не менее, немаловажным будет и знакомство с её участниками.</p>
        <h3>Текущий состав:</h3>
        <p><a href="https://github.com/RusFeniks" target="_blank">RusFeniks</a> - ака Касай ака Феникс ака Петух - отец и основатель современной команды ATOM, олдфаг, создатель NORM</p>
        <details>
          <summary></summary>
          <img src="img/meme/1.png" height="210" alt="1 часть мема" />
          <img src="img/meme/2.png" height="210" alt="2 часть мема" />
          <img src="img/meme/3.png" height="210" alt="3 часть мема" />
          <img src="img/meme/4.png" height="210" alt="4 часть мема" />
        </details>
        <p><a href="https://github.com/abelidze" target="_blank">abelidze</a> - крутой программист, прибыл на помощь в разработке Love2d Fighting</p>
        <p><a href="https://github.com/Favorass" target="_blank">Favoras</a> - пожилое Гуччи, дизайнер NORM, падаван Петучи в ВУЗовском программировании и тот, кто делает этот сайт</p>

        <h3>Бывшие участники:</h3>
        <p><a href="http://google.com" target="_blank">Soul</a> - бла бла бла бла бла</p>
      </center>
    </div>
  </div>


  <div id="social">
    <h1>Мы в социальных сетях</h1>
    <div id="social" align="center">
      <a href="https://github.com/atom-tm" target="_blank"><img src="img/social/github.png" id="social-img" alt="Мы на GitHub"></a>
      <a href="https://discordapp.com/invite/s6vBRE4" target="_blank"><img src="img/social/discord.png" id="social-img" alt="Мы в Discord"></a>
      <a href="https://vk.com/atom_tm" target="_blank"><img src="img/social/vk.png" id="social-img" alt="Мы в VK"></a>
      <a href="https://www.youtube.com/user/KDFeniks" target="_blank"><img src="img/social/youtube.png" id="social-img" alt="Мы на Youtube"></a>
    </div>
  </div>

  <hr class="hr-main" />

  <footer>
    <small>&copy; Copyright 2019, ATOM-TM <p>Design by <a href="https://github.com/Favorass" id="favoras">Favoras</a></p></small>
  </footer>
</div>
</template>

<script>
  // import HelloWorld from './components/HelloWorld.vue'

  export default {
    name: 'app',
    // components: {
    //   HelloWorld
    // }
  }
</script>

<style lang="scss">
  #app {
    font-family: 'Avenir', Helvetica, Arial, sans-serif;
    -webkit-font-smoothing: antialiased;
    -moz-osx-font-smoothing: grayscale;
  }
</style>
